
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "Изменилась цена";
		
	ПересчитатьСумму(ТекущиеДанные, ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму(ТекущиеДанные, ТекстСообщения)
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (ТекстСообщения);
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "Изменилось количество";
		
	ПересчитатьСумму(ТекущиеДанные, ТекстСообщения);
	
КонецПроцедуры



